tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"

tap "caskroom/cask"
cask "java"

brew "autoconf"
brew "autojump"
brew "automake"
brew "curl"
brew "git"
brew "sj26/forks/gist", args: ["HEAD"]
brew "hub"
brew "jq"
brew "pv"
brew "psgrep"
brew "pstree"
brew "rename"
brew "the_silver_searcher"
brew "tree"
brew "vim"
brew "watch"
brew "wget"

brew "elasticsearch", restart_service: :changed
brew "memcached", restart_service: :changed
brew "mysql", restart_service: :changed
brew "postgresql", restart_service: :changed
brew "postgis"
brew "redis", restart_service: :changed

brew "rbenv"
brew "ruby-build"
brew "rbenv-aliases"
brew "rbenv-communal-gems"
brew "rbenv-default-gems"
brew "rbenv-vars"

cask "aws-vault"
cask "caffeine"
cask "dropbox"
cask "gpgtools"
cask "iterm2"
cask "scroll-reverser"
cask "slate"
cask "transmit"

tap "puma/puma"
brew "puma/puma/puma-dev"

tap "nodenv/nodenv"
brew "nodenv"
brew "node-build"
brew "nodenv/nodenv/nodenv-aliases"
brew "nodenv/nodenv/nodenv-default-packages"
brew "nodenv/nodenv/nodenv-package-rehash"

brew "mas"
mas "Affinity Designer", id: 824171161
mas "DaisyDisk", id: 411643860
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Things3", id: 904280696
mas "Tweetbot", id: 557168941
