tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"

tap "caskroom/cask"
cask "1password"
cask "aws-vault"
cask "bonjour-browser"
cask "docker"
cask "gpg-suite"
cask "slate"
cask "transmit"

cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "webpquicklook"

brew "autoconf"
brew "autojump"
brew "automake"
brew "curl"
brew "fzf"
brew "git"
brew "hub"
brew "jq"
brew "pv"
brew "psgrep"
brew "pstree"
brew "rename"
brew "ripgrep"
brew "tree"
brew "vim"
brew "watch"
brew "wget"

#brew "elasticsearch", restart_service: :changed
brew "memcached", restart_service: :changed
#brew "mysql", restart_service: :changed
brew "postgresql", restart_service: :changed
brew "postgis"
brew "redis", restart_service: :changed

brew "rbenv"
brew "ruby-build"
brew "rbenv-aliases"
brew "rbenv-communal-gems"
brew "rbenv-default-gems"

tap "sj26/forks"
brew "sj26/forks/gist", args: ["HEAD"]

tap "puma/puma"
brew "puma/puma/puma-dev"

tap "nodenv/nodenv"
brew "nodenv"
brew "node-build"
brew "nodenv/nodenv/nodenv-aliases"
brew "nodenv/nodenv/nodenv-default-packages"
brew "nodenv/nodenv/nodenv-package-rehash"

brew "mas"
#mas "Affinity Designer", id: 824171161
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 880001334
mas "Telegram", id: 747648890
